zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_gc/pic32ck_gc01/include/pio/pic32ck1012gc01064.h
#define PIN_PA07B_AC_AIN1                          _UINT32_(7) 
#define MUX_PA07B_AC_AIN1                          _UINT32_(1) 
#define PINMUX_PA07B_AC_AIN1                       ((PIN_PA07B_AC_AIN1 << 16) | MUX_PA07B_AC_AIN1)
#define PORT_PA07B_AC_AIN1                         (_UINT32_(1) << 7)

#define PIN_PA10B_AC_AIN1                          _UINT32_(10)
#define MUX_PA10B_AC_AIN1                          _UINT32_(1) 
#define PINMUX_PA10B_AC_AIN1                       ((PIN_PA10B_AC_AIN1 << 16) | MUX_PA10B_AC_AIN1)
#define PORT_PA10B_AC_AIN1                         (_UINT32_(1) << 10)

#define PIN_PC06B_AC_AIN2                          _UINT32_(70)
#define MUX_PC06B_AC_AIN2                          _UINT32_(1) 
#define PINMUX_PC06B_AC_AIN2                       ((PIN_PC06B_AC_AIN2 << 16) | MUX_PC06B_AC_AIN2)
#define PORT_PC06B_AC_AIN2                         (_UINT32_(1) << 6)

#define PIN_PC07B_AC_AIN3                          _UINT32_(71)
#define MUX_PC07B_AC_AIN3                          _UINT32_(1) 
#define PINMUX_PC07B_AC_AIN3                       ((PIN_PC07B_AC_AIN3 << 16) | MUX_PC07B_AC_AIN3)
#define PORT_PC07B_AC_AIN3                         (_UINT32_(1) << 7)

#define PIN_PA11M_AC_CMP0                          _UINT32_(11)
#define MUX_PA11M_AC_CMP0                          _UINT32_(12)
#define PINMUX_PA11M_AC_CMP0                       ((PIN_PA11M_AC_CMP0 << 16) | MUX_PA11M_AC_CMP0)
#define PORT_PA11M_AC_CMP0                         (_UINT32_(1) << 11)

#define PIN_PC09M_AC_CMP0                          _UINT32_(73)
#define MUX_PC09M_AC_CMP0                          _UINT32_(12)
#define PINMUX_PC09M_AC_CMP0                       ((PIN_PC09M_AC_CMP0 << 16) | MUX_PC09M_AC_CMP0)
#define PORT_PC09M_AC_CMP0                         (_UINT32_(1) << 9)

#define PIN_PA12M_AC_CMP1                          _UINT32_(12)
#define MUX_PA12M_AC_CMP1                          _UINT32_(12)
#define PINMUX_PA12M_AC_CMP1                       ((PIN_PA12M_AC_CMP1 << 16) | MUX_PA12M_AC_CMP1)
#define PORT_PA12M_AC_CMP1                         (_UINT32_(1) << 12)

/* =================== PORT definition for ADC peripheral =================== */
#define PIN_PA05B_ADC_VINM0                        _UINT32_(5) 
#define MUX_PA05B_ADC_VINM0                        _UINT32_(1) 
#define PINMUX_PA05B_ADC_VINM0                     ((PIN_PA05B_ADC_VINM0 << 16) | MUX_PA05B_ADC_VINM0)
#define PORT_PA05B_ADC_VINM0                       (_UINT32_(1) << 5)

#define PIN_PA07B_ADC_VINM2                        _UINT32_(7) 
#define MUX_PA07B_ADC_VINM2                        _UINT32_(1) 
#define PINMUX_PA07B_ADC_VINM2                     ((PIN_PA07B_ADC_VINM2 << 16) | MUX_PA07B_ADC_VINM2)
#define PORT_PA07B_ADC_VINM2                       (_UINT32_(1) << 7)

#define PIN_PA04B_ADC_VINP0                        _UINT32_(4) 
#define MUX_PA04B_ADC_VINP0                        _UINT32_(1) 
#define PINMUX_PA04B_ADC_VINP0                     ((PIN_PA04B_ADC_VINP0 << 16) | MUX_PA04B_ADC_VINP0)
#define PORT_PA04B_ADC_VINP0                       (_UINT32_(1) << 4)

#define PIN_PA05B_ADC_VINP1                        _UINT32_(5) 
#define MUX_PA05B_ADC_VINP1                        _UINT32_(1) 
#define PINMUX_PA05B_ADC_VINP1                     ((PIN_PA05B_ADC_VINP1 << 16) | MUX_PA05B_ADC_VINP1)
#define PORT_PA05B_ADC_VINP1                       (_UINT32_(1) << 5)

#define PIN_PA06B_ADC_VINP2                        _UINT32_(6) 
#define MUX_PA06B_ADC_VINP2                        _UINT32_(1) 
#define PINMUX_PA06B_ADC_VINP2                     ((PIN_PA06B_ADC_VINP2 << 16) | MUX_PA06B_ADC_VINP2)
#define PORT_PA06B_ADC_VINP2                       (_UINT32_(1) << 6)

#define PIN_PA07B_ADC_VINP3                        _UINT32_(7) 
#define MUX_PA07B_ADC_VINP3                        _UINT32_(1) 
#define PINMUX_PA07B_ADC_VINP3                     ((PIN_PA07B_ADC_VINP3 << 16) | MUX_PA07B_ADC_VINP3)
#define PORT_PA07B_ADC_VINP3                       (_UINT32_(1) << 7)

#define PIN_PA08B_ADC_VINP4                        _UINT32_(8) 
#define MUX_PA08B_ADC_VINP4                        _UINT32_(1) 
#define PINMUX_PA08B_ADC_VINP4                     ((PIN_PA08B_ADC_VINP4 << 16) | MUX_PA08B_ADC_VINP4)
#define PORT_PA08B_ADC_VINP4                       (_UINT32_(1) << 8)

#define PIN_PA09B_ADC_VINP5                        _UINT32_(9) 
#define MUX_PA09B_ADC_VINP5                        _UINT32_(1) 
#define PINMUX_PA09B_ADC_VINP5                     ((PIN_PA09B_ADC_VINP5 << 16) | MUX_PA09B_ADC_VINP5)
#define PORT_PA09B_ADC_VINP5                       (_UINT32_(1) << 9)

#define PIN_PA10B_ADC_VINP6                        _UINT32_(10)
#define MUX_PA10B_ADC_VINP6                        _UINT32_(1) 
#define PINMUX_PA10B_ADC_VINP6                     ((PIN_PA10B_ADC_VINP6 << 16) | MUX_PA10B_ADC_VINP6)
#define PORT_PA10B_ADC_VINP6                       (_UINT32_(1) << 10)

#define PIN_PA11B_ADC_VINP7                        _UINT32_(11)
#define MUX_PA11B_ADC_VINP7                        _UINT32_(1) 
#define PINMUX_PA11B_ADC_VINP7                     ((PIN_PA11B_ADC_VINP7 << 16) | MUX_PA11B_ADC_VINP7)
#define PORT_PA11B_ADC_VINP7                       (_UINT32_(1) << 11)

#define PIN_PA12B_ADC_VINP8                        _UINT32_(12)
#define MUX_PA12B_ADC_VINP8                        _UINT32_(1) 
#define PINMUX_PA12B_ADC_VINP8                     ((PIN_PA12B_ADC_VINP8 << 16) | MUX_PA12B_ADC_VINP8)
#define PORT_PA12B_ADC_VINP8                       (_UINT32_(1) << 12)

#define PIN_PB00B_ADC_VINP9                        _UINT32_(32)
#define MUX_PB00B_ADC_VINP9                        _UINT32_(1) 
#define PINMUX_PB00B_ADC_VINP9                     ((PIN_PB00B_ADC_VINP9 << 16) | MUX_PB00B_ADC_VINP9)
#define PORT_PB00B_ADC_VINP9                       (_UINT32_(1) << 0)

#define PIN_PB01B_ADC_VREFP0                       _UINT32_(33)
#define MUX_PB01B_ADC_VREFP0                       _UINT32_(1) 
#define PINMUX_PB01B_ADC_VREFP0                    ((PIN_PB01B_ADC_VREFP0 << 16) | MUX_PB01B_ADC_VREFP0)
#define PORT_PB01B_ADC_VREFP0                      (_UINT32_(1) << 1)

/* ================== PORT definition for BSDAP peripheral ================== */
#define PIN_PA03G_BSDAP_TCK_SWCLK                  _UINT32_(3) 
#define MUX_PA03G_BSDAP_TCK_SWCLK                  _UINT32_(6) 
#define PINMUX_PA03G_BSDAP_TCK_SWCLK               ((PIN_PA03G_BSDAP_TCK_SWCLK << 16) | MUX_PA03G_BSDAP_TCK_SWCLK)
#define PORT_PA03G_BSDAP_TCK_SWCLK                 (_UINT32_(1) << 3)

#define PIN_PA00G_BSDAP_TDI                        _UINT32_(0) 
#define MUX_PA00G_BSDAP_TDI                        _UINT32_(6) 
#define PINMUX_PA00G_BSDAP_TDI                     ((PIN_PA00G_BSDAP_TDI << 16) | MUX_PA00G_BSDAP_TDI)
#define PORT_PA00G_BSDAP_TDI                       (_UINT32_(1) << 0)

#define PIN_PA01G_BSDAP_TDO                        _UINT32_(1) 
#define MUX_PA01G_BSDAP_TDO                        _UINT32_(6) 
#define PINMUX_PA01G_BSDAP_TDO                     ((PIN_PA01G_BSDAP_TDO << 16) | MUX_PA01G_BSDAP_TDO)
#define PORT_PA01G_BSDAP_TDO                       (_UINT32_(1) << 1)

#define PIN_PA02G_BSDAP_TMS_SWDIO                  _UINT32_(2) 
#define MUX_PA02G_BSDAP_TMS_SWDIO                  _UINT32_(6) 
#define PINMUX_PA02G_BSDAP_TMS_SWDIO               ((PIN_PA02G_BSDAP_TMS_SWDIO << 16) | MUX_PA02G_BSDAP_TMS_SWDIO)
#define PORT_PA02G_BSDAP_TMS_SWDIO                 (_UINT32_(1) << 2)

