zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_gc/pic32ck_gc01/include/pio/pic32ck1012gc01064.h
#define PIN_PB08N_PTC_DRV7                         _UINT32_(40)
#define MUX_PB08N_PTC_DRV7                         _UINT32_(13)
#define PINMUX_PB08N_PTC_DRV7                      ((PIN_PB08N_PTC_DRV7 << 16) | MUX_PB08N_PTC_DRV7)
#define PORT_PB08N_PTC_DRV7                        (_UINT32_(1) << 8)

#define PIN_PB09N_PTC_DRV8                         _UINT32_(41)
#define MUX_PB09N_PTC_DRV8                         _UINT32_(13)
#define PINMUX_PB09N_PTC_DRV8                      ((PIN_PB09N_PTC_DRV8 << 16) | MUX_PB09N_PTC_DRV8)
#define PORT_PB09N_PTC_DRV8                        (_UINT32_(1) << 9)

#define PIN_PB10N_PTC_DRV9                         _UINT32_(42)
#define MUX_PB10N_PTC_DRV9                         _UINT32_(13)
#define PINMUX_PB10N_PTC_DRV9                      ((PIN_PB10N_PTC_DRV9 << 16) | MUX_PB10N_PTC_DRV9)
#define PORT_PB10N_PTC_DRV9                        (_UINT32_(1) << 10)

#define PIN_PC00N_PTC_DRV10                        _UINT32_(64)
#define MUX_PC00N_PTC_DRV10                        _UINT32_(13)
#define PINMUX_PC00N_PTC_DRV10                     ((PIN_PC00N_PTC_DRV10 << 16) | MUX_PC00N_PTC_DRV10)
#define PORT_PC00N_PTC_DRV10                       (_UINT32_(1) << 0)

#define PIN_PC01N_PTC_DRV11                        _UINT32_(65)
#define MUX_PC01N_PTC_DRV11                        _UINT32_(13)
#define PINMUX_PC01N_PTC_DRV11                     ((PIN_PC01N_PTC_DRV11 << 16) | MUX_PC01N_PTC_DRV11)
#define PORT_PC01N_PTC_DRV11                       (_UINT32_(1) << 1)

#define PIN_PC02N_PTC_DRV12                        _UINT32_(66)
#define MUX_PC02N_PTC_DRV12                        _UINT32_(13)
#define PINMUX_PC02N_PTC_DRV12                     ((PIN_PC02N_PTC_DRV12 << 16) | MUX_PC02N_PTC_DRV12)
#define PORT_PC02N_PTC_DRV12                       (_UINT32_(1) << 2)

#define PIN_PC03N_PTC_DRV13                        _UINT32_(67)
#define MUX_PC03N_PTC_DRV13                        _UINT32_(13)
#define PINMUX_PC03N_PTC_DRV13                     ((PIN_PC03N_PTC_DRV13 << 16) | MUX_PC03N_PTC_DRV13)
#define PORT_PC03N_PTC_DRV13                       (_UINT32_(1) << 3)

#define PIN_PC04N_PTC_DRV14                        _UINT32_(68)
#define MUX_PC04N_PTC_DRV14                        _UINT32_(13)
#define PINMUX_PC04N_PTC_DRV14                     ((PIN_PC04N_PTC_DRV14 << 16) | MUX_PC04N_PTC_DRV14)
#define PORT_PC04N_PTC_DRV14                       (_UINT32_(1) << 4)

#define PIN_PC05N_PTC_DRV15                        _UINT32_(69)
#define MUX_PC05N_PTC_DRV15                        _UINT32_(13)
#define PINMUX_PC05N_PTC_DRV15                     ((PIN_PC05N_PTC_DRV15 << 16) | MUX_PC05N_PTC_DRV15)
#define PORT_PC05N_PTC_DRV15                       (_UINT32_(1) << 5)

#define PIN_PC06N_PTC_DRV16                        _UINT32_(70)
#define MUX_PC06N_PTC_DRV16                        _UINT32_(13)
#define PINMUX_PC06N_PTC_DRV16                     ((PIN_PC06N_PTC_DRV16 << 16) | MUX_PC06N_PTC_DRV16)
#define PORT_PC06N_PTC_DRV16                       (_UINT32_(1) << 6)

#define PIN_PC07N_PTC_DRV17                        _UINT32_(71)
#define MUX_PC07N_PTC_DRV17                        _UINT32_(13)
#define PINMUX_PC07N_PTC_DRV17                     ((PIN_PC07N_PTC_DRV17 << 16) | MUX_PC07N_PTC_DRV17)
#define PORT_PC07N_PTC_DRV17                       (_UINT32_(1) << 7)

#define PIN_PC13N_PTC_DRV18                        _UINT32_(77)
#define MUX_PC13N_PTC_DRV18                        _UINT32_(13)
#define PINMUX_PC13N_PTC_DRV18                     ((PIN_PC13N_PTC_DRV18 << 16) | MUX_PC13N_PTC_DRV18)
#define PORT_PC13N_PTC_DRV18                       (_UINT32_(1) << 13)

#define PIN_PC09N_PTC_DRV19                        _UINT32_(73)
#define MUX_PC09N_PTC_DRV19                        _UINT32_(13)
#define PINMUX_PC09N_PTC_DRV19                     ((PIN_PC09N_PTC_DRV19 << 16) | MUX_PC09N_PTC_DRV19)
#define PORT_PC09N_PTC_DRV19                       (_UINT32_(1) << 9)

#define PIN_PC10N_PTC_DRV20                        _UINT32_(74)
#define MUX_PC10N_PTC_DRV20                        _UINT32_(13)
#define PINMUX_PC10N_PTC_DRV20                     ((PIN_PC10N_PTC_DRV20 << 16) | MUX_PC10N_PTC_DRV20)
#define PORT_PC10N_PTC_DRV20                       (_UINT32_(1) << 10)

#define PIN_PC11N_PTC_DRV21                        _UINT32_(75)
#define MUX_PC11N_PTC_DRV21                        _UINT32_(13)
#define PINMUX_PC11N_PTC_DRV21                     ((PIN_PC11N_PTC_DRV21 << 16) | MUX_PC11N_PTC_DRV21)
#define PORT_PC11N_PTC_DRV21                       (_UINT32_(1) << 11)

#define PIN_PC12N_PTC_DRV22                        _UINT32_(76)
#define MUX_PC12N_PTC_DRV22                        _UINT32_(13)
#define PINMUX_PC12N_PTC_DRV22                     ((PIN_PC12N_PTC_DRV22 << 16) | MUX_PC12N_PTC_DRV22)
#define PORT_PC12N_PTC_DRV22                       (_UINT32_(1) << 12)

/* ================= PORT definition for SDMMC0 peripheral ================== */
#define PIN_PA10I_SDMMC0_SDCD                      _UINT32_(10)
#define MUX_PA10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA10I_SDMMC0_SDCD                   ((PIN_PA10I_SDMMC0_SDCD << 16) | MUX_PA10I_SDMMC0_SDCD)
#define PORT_PA10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PA12I_SDMMC0_SDCD                      _UINT32_(12)
#define MUX_PA12I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA12I_SDMMC0_SDCD                   ((PIN_PA12I_SDMMC0_SDCD << 16) | MUX_PA12I_SDMMC0_SDCD)
#define PORT_PA12I_SDMMC0_SDCD                     (_UINT32_(1) << 12)

#define PIN_PC04I_SDMMC0_SDCD                      _UINT32_(68)
#define MUX_PC04I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC04I_SDMMC0_SDCD                   ((PIN_PC04I_SDMMC0_SDCD << 16) | MUX_PC04I_SDMMC0_SDCD)
#define PORT_PC04I_SDMMC0_SDCD                     (_UINT32_(1) << 4)

#define PIN_PC10I_SDMMC0_SDCD                      _UINT32_(74)
#define MUX_PC10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC10I_SDMMC0_SDCD                   ((PIN_PC10I_SDMMC0_SDCD << 16) | MUX_PC10I_SDMMC0_SDCD)
#define PORT_PC10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PC05I_SDMMC0_SDCK                      _UINT32_(69)
#define MUX_PC05I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PC05I_SDMMC0_SDCK                   ((PIN_PC05I_SDMMC0_SDCK << 16) | MUX_PC05I_SDMMC0_SDCK)
#define PORT_PC05I_SDMMC0_SDCK                     (_UINT32_(1) << 5)

#define PIN_PD10I_SDMMC0_SDCK                      _UINT32_(106)
#define MUX_PD10I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PD10I_SDMMC0_SDCK                   ((PIN_PD10I_SDMMC0_SDCK << 16) | MUX_PD10I_SDMMC0_SDCK)
#define PORT_PD10I_SDMMC0_SDCK                     (_UINT32_(1) << 10)

