zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_gc/pic32ck_gc01/include/pio/pic32ck1012gc01064.h
#define PIN_PA01C_SERCOM0_PAD3                     _UINT32_(1) 
#define MUX_PA01C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PA01C_SERCOM0_PAD3                  ((PIN_PA01C_SERCOM0_PAD3 << 16) | MUX_PA01C_SERCOM0_PAD3)
#define PORT_PA01C_SERCOM0_PAD3                    (_UINT32_(1) << 1)

#define PIN_PC13C_SERCOM0_PAD3                     _UINT32_(77)
#define MUX_PC13C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM0_PAD3                  ((PIN_PC13C_SERCOM0_PAD3 << 16) | MUX_PC13C_SERCOM0_PAD3)
#define PORT_PC13C_SERCOM0_PAD3                    (_UINT32_(1) << 13)

/* ================= PORT definition for SERCOM1 peripheral ================= */
#define PIN_PA00D_SERCOM1_PAD0                     _UINT32_(0) 
#define MUX_PA00D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM1_PAD0                  ((PIN_PA00D_SERCOM1_PAD0 << 16) | MUX_PA00D_SERCOM1_PAD0)
#define PORT_PA00D_SERCOM1_PAD0                    (_UINT32_(1) << 0)

#define PIN_PD08C_SERCOM1_PAD0                     _UINT32_(104)
#define MUX_PD08C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PD08C_SERCOM1_PAD0                  ((PIN_PD08C_SERCOM1_PAD0 << 16) | MUX_PD08C_SERCOM1_PAD0)
#define PORT_PD08C_SERCOM1_PAD0                    (_UINT32_(1) << 8)

#define PIN_PA01D_SERCOM1_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM1_PAD1                  ((PIN_PA01D_SERCOM1_PAD1 << 16) | MUX_PA01D_SERCOM1_PAD1)
#define PORT_PA01D_SERCOM1_PAD1                    (_UINT32_(1) << 1)

#define PIN_PD09C_SERCOM1_PAD1                     _UINT32_(105)
#define MUX_PD09C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PD09C_SERCOM1_PAD1                  ((PIN_PD09C_SERCOM1_PAD1 << 16) | MUX_PD09C_SERCOM1_PAD1)
#define PORT_PD09C_SERCOM1_PAD1                    (_UINT32_(1) << 9)

#define PIN_PD06D_SERCOM1_PAD2                     _UINT32_(102)
#define MUX_PD06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM1_PAD2                  ((PIN_PD06D_SERCOM1_PAD2 << 16) | MUX_PD06D_SERCOM1_PAD2)
#define PORT_PD06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PD10C_SERCOM1_PAD2                     _UINT32_(106)
#define MUX_PD10C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PD10C_SERCOM1_PAD2                  ((PIN_PD10C_SERCOM1_PAD2 << 16) | MUX_PD10C_SERCOM1_PAD2)
#define PORT_PD10C_SERCOM1_PAD2                    (_UINT32_(1) << 10)

#define PIN_PD07D_SERCOM1_PAD3                     _UINT32_(103)
#define MUX_PD07D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PD07D_SERCOM1_PAD3                  ((PIN_PD07D_SERCOM1_PAD3 << 16) | MUX_PD07D_SERCOM1_PAD3)
#define PORT_PD07D_SERCOM1_PAD3                    (_UINT32_(1) << 7)

#define PIN_PD11C_SERCOM1_PAD3                     _UINT32_(107)
#define MUX_PD11C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PD11C_SERCOM1_PAD3                  ((PIN_PD11C_SERCOM1_PAD3 << 16) | MUX_PD11C_SERCOM1_PAD3)
#define PORT_PD11C_SERCOM1_PAD3                    (_UINT32_(1) << 11)

/* ================= PORT definition for SERCOM2 peripheral ================= */
#define PIN_PC11D_SERCOM2_PAD0                     _UINT32_(75)
#define MUX_PC11D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM2_PAD0                  ((PIN_PC11D_SERCOM2_PAD0 << 16) | MUX_PC11D_SERCOM2_PAD0)
#define PORT_PC11D_SERCOM2_PAD0                    (_UINT32_(1) << 11)

#define PIN_PC06C_SERCOM2_PAD0                     _UINT32_(70)
#define MUX_PC06C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PC06C_SERCOM2_PAD0                  ((PIN_PC06C_SERCOM2_PAD0 << 16) | MUX_PC06C_SERCOM2_PAD0)
#define PORT_PC06C_SERCOM2_PAD0                    (_UINT32_(1) << 6)

#define PIN_PC10D_SERCOM2_PAD1                     _UINT32_(74)
#define MUX_PC10D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM2_PAD1                  ((PIN_PC10D_SERCOM2_PAD1 << 16) | MUX_PC10D_SERCOM2_PAD1)
#define PORT_PC10D_SERCOM2_PAD1                    (_UINT32_(1) << 10)

#define PIN_PC07C_SERCOM2_PAD1                     _UINT32_(71)
#define MUX_PC07C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PC07C_SERCOM2_PAD1                  ((PIN_PC07C_SERCOM2_PAD1 << 16) | MUX_PC07C_SERCOM2_PAD1)
#define PORT_PC07C_SERCOM2_PAD1                    (_UINT32_(1) << 7)

#define PIN_PC05D_SERCOM2_PAD2                     _UINT32_(69)
#define MUX_PC05D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM2_PAD2                  ((PIN_PC05D_SERCOM2_PAD2 << 16) | MUX_PC05D_SERCOM2_PAD2)
#define PORT_PC05D_SERCOM2_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC12D_SERCOM2_PAD2                     _UINT32_(76)
#define MUX_PC12D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM2_PAD2                  ((PIN_PC12D_SERCOM2_PAD2 << 16) | MUX_PC12D_SERCOM2_PAD2)
#define PORT_PC12D_SERCOM2_PAD2                    (_UINT32_(1) << 12)

#define PIN_PC09C_SERCOM2_PAD2                     _UINT32_(73)
#define MUX_PC09C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PC09C_SERCOM2_PAD2                  ((PIN_PC09C_SERCOM2_PAD2 << 16) | MUX_PC09C_SERCOM2_PAD2)
#define PORT_PC09C_SERCOM2_PAD2                    (_UINT32_(1) << 9)

#define PIN_PC02D_SERCOM2_PAD3                     _UINT32_(66)
#define MUX_PC02D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM2_PAD3                  ((PIN_PC02D_SERCOM2_PAD3 << 16) | MUX_PC02D_SERCOM2_PAD3)
#define PORT_PC02D_SERCOM2_PAD3                    (_UINT32_(1) << 2)

#define PIN_PC13D_SERCOM2_PAD3                     _UINT32_(77)
#define MUX_PC13D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM2_PAD3                  ((PIN_PC13D_SERCOM2_PAD3 << 16) | MUX_PC13D_SERCOM2_PAD3)
#define PORT_PC13D_SERCOM2_PAD3                    (_UINT32_(1) << 13)

/* ================= PORT definition for SERCOM3 peripheral ================= */
#define PIN_PC07D_SERCOM3_PAD0                     _UINT32_(71)
#define MUX_PC07D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC07D_SERCOM3_PAD0                  ((PIN_PC07D_SERCOM3_PAD0 << 16) | MUX_PC07D_SERCOM3_PAD0)
#define PORT_PC07D_SERCOM3_PAD0                    (_UINT32_(1) << 7)

#define PIN_PC02C_SERCOM3_PAD0                     _UINT32_(66)
#define MUX_PC02C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PC02C_SERCOM3_PAD0                  ((PIN_PC02C_SERCOM3_PAD0 << 16) | MUX_PC02C_SERCOM3_PAD0)
#define PORT_PC02C_SERCOM3_PAD0                    (_UINT32_(1) << 2)

